#1. Виділити один зі стовпців (на вибір) з файлу як об’єкт Series, виділити з
#нього підмасив. Задати назви індексів цього об’єкту. Виділити підмасиви
#за допомогою прямої та непрямої індексацій.

#2. До об’єкту DataFrame, в який записано вміст файлу, додати новий
#стовпець, що є результатом операцій над іншими стовпцями. Також
#продемонструвати додавання та видалення рядків, видалення стовпців.

#3. Встановити один зі стовпців індексом. Визначити основні статистичні
#характеристики та типи даних всіх стовпців. Змінити тип даних для
#одного з стовпців. Згрупувати дані за одним зі стовпців, застосувати
#кілька агрегуючих функцій, виділити підмасив за певними ознаками.

#4. Створити декілька власних об’єктів DataFrame за такою ж тематикою, що
#й файл. Наприклад, якщо тема файлу – жаби, можна створити об’єкти,
#що містять розміри жаб, вагу, стать, кількість особин в популяції і т.д.
#Використати описані в теоретичних відомостях параметри методів merge
#та concat для різних видів злиття та об’єднання даних цих об’єктів.